#include "stdio.h"

/*
2、矩阵相乘
输入2×3矩阵A和3×2矩阵B各元素值，计算矩阵A和矩阵B相乘的结果

输入说明：输入整形数组A和数组B,数组元素用空格分隔

输出说明：输出矩阵A*B的结果，矩阵元素之间用空格分隔，数组每行元素用换行分隔

输入样例：
1 2 3
4 5 6
1 2
3 4 
5 6

输出样例
22 28
49 64
*/

int main(void){
    int a[2][3]={0},b[3][2]={0};
    int i,j;
    for(i=0;i<2;i++){
        for(j=0;j<3;j++){
            scanf("%d",&a[i][j]);
        }
    }
    for(i=0;i<3;i++){
        for(j=0;j<2;j++){
            scanf("%d",&b[i][j]);
        }
    }
    int c[2][2]={0};
    int t=0;
    for(i=0;i<3;i++){
        c[0][0]+=a[0][i]*b[i][0];
        c[0][1]+=a[0][i]*b[i][1];
        c[1][0]+=a[1][i]*b[i][0];
        c[1][1]+=a[1][i]*b[i][1];
    }
    for(i=0;i<2;i++){
        for(j=0;j<2;j++){
            printf("%d ",c[i][j]);
        }
        printf("\n");
    }
}